#### Terraform Init: `✅`
#### Terraform Plan: `✅ 2 to add, 5 to change, 2 to destroy.`

<details>
<summary>Show Plan</summary>

```
[command]/home/runner/work/_temp/596a9dba-b0d8-4239-a16d-1f2dd1769b6c/terraform-bin plan -no-color
Acquiring state lock. This may take a few moments...
data.cloudinit_config.this: Reading...
hcloud_network.this: Refreshing state... [id=10373733]
data.hcloud_image.this: Reading...
hcloud_ssh_key.default: Refreshing state... [id=24905759]
data.hetznerdns_zone.this: Reading...
hcloud_firewall.basic: Refreshing state... [id=1748182]
data.cloudinit_config.this: Read complete after 0s [id=4166460097]
data.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]
data.hcloud_image.this: Read complete after 1s
hcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]
hcloud_server.projects-server: Refreshing state... [id=57836166]
hetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]
hcloud_volume.this: Refreshing state... [id=101632658]
hcloud_server_network.this: Refreshing state... [id=57836166-10373733]
hetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]
hetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]
hetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.projects-server must be replaced
-/+ resource "hcloud_server" "projects-server" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "fsn1-dc14" -> (known after apply)
      ~ id                         = "57836166" -> (known after apply)
      ~ ipv4_address               = "188.245.227.94" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:c012:20a7::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:c012:20a7::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "projects-server"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "3wqxExxvS4NpFK5goy4DcSkhplA=" -> "6TJnYiNGkYx5i68+lsjISvxC0Ts=" # forces replacement
        # (12 unchanged attributes hidden)
    }

  # hcloud_server_network.this must be replaced
-/+ resource "hcloud_server_network" "this" {
      - alias_ips   = [] -> null
      ~ id          = "57836166-10373733" -> (known after apply)
      ~ mac_address = "86:00:00:e3:63:49" -> (known after apply)
      ~ server_id   = 57836166 -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # hcloud_volume.this will be updated in-place
  ~ resource "hcloud_volume" "this" {
        id                = "101632658"
        name              = "persistent-storage"
      ~ server_id         = 57836166 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks" {
        id      = "da4433c705ee878f5f69348f54b956ef"
        name    = "bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks-api will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks-api" {
        id      = "81253d86efc1c38e4afb06c662d6a409"
        name    = "api.bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.geometrierechner will be updated in-place
  ~ resource "hetznerdns_record" "geometrierechner" {
        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"
        name    = "geometrierechner"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.homepage will be updated in-place
  ~ resource "hetznerdns_record" "homepage" {
        id      = "912db7ec956005d7343406b8b2adb320"
        name    = "@"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ server_ip = "188.245.227.94" -> (known after apply)
  ~ status    = "running" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Adata.cloudinit_config.this: Reading...%0Ahcloud_network.this: Refreshing state... [id=10373733]%0Adata.hcloud_image.this: Reading...%0Ahcloud_ssh_key.default: Refreshing state... [id=24905759]%0Adata.hetznerdns_zone.this: Reading...%0Ahcloud_firewall.basic: Refreshing state... [id=1748182]%0Adata.cloudinit_config.this: Read complete after 0s [id=4166460097]%0Adata.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]%0Adata.hcloud_image.this: Read complete after 1s%0Ahcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]%0Ahcloud_server.projects-server: Refreshing state... [id=57836166]%0Ahetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]%0Ahcloud_volume.this: Refreshing state... [id=101632658]%0Ahcloud_server_network.this: Refreshing state... [id=57836166-10373733]%0Ahetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]%0Ahetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]%0Ahetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # hcloud_server.projects-server must be replaced%0A-/+ resource "hcloud_server" "projects-server" {%0A      + backup_window              = (known after apply)%0A      ~ datacenter                 = "fsn1-dc14" -> (known after apply)%0A      ~ id                         = "57836166" -> (known after apply)%0A      ~ ipv4_address               = "188.245.227.94" -> (known after apply)%0A      ~ ipv6_address               = "2a01:4f8:c012:20a7::1" -> (known after apply)%0A      ~ ipv6_network               = "2a01:4f8:c012:20a7::/64" -> (known after apply)%0A      - labels                     = {} -> null%0A        name                       = "projects-server"%0A      - placement_group_id         = 0 -> null%0A      ~ primary_disk_size          = 40 -> (known after apply)%0A      ~ status                     = "running" -> (known after apply)%0A      ~ user_data                  = "3wqxExxvS4NpFK5goy4DcSkhplA=" -> "6TJnYiNGkYx5i68+lsjISvxC0Ts=" # forces replacement%0A        # (12 unchanged attributes hidden)%0A    }%0A%0A  # hcloud_server_network.this must be replaced%0A-/+ resource "hcloud_server_network" "this" {%0A      - alias_ips   = [] -> null%0A      ~ id          = "57836166-10373733" -> (known after apply)%0A      ~ mac_address = "86:00:00:e3:63:49" -> (known after apply)%0A      ~ server_id   = 57836166 -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # hcloud_volume.this will be updated in-place%0A  ~ resource "hcloud_volume" "this" {%0A        id                = "101632658"%0A        name              = "persistent-storage"%0A      ~ server_id         = 57836166 -> (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks" {%0A        id      = "da4433c705ee878f5f69348f54b956ef"%0A        name    = "bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks-api will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks-api" {%0A        id      = "81253d86efc1c38e4afb06c662d6a409"%0A        name    = "api.bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.geometrierechner will be updated in-place%0A  ~ resource "hetznerdns_record" "geometrierechner" {%0A        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"%0A        name    = "geometrierechner"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.homepage will be updated in-place%0A  ~ resource "hetznerdns_record" "homepage" {%0A        id      = "912db7ec956005d7343406b8b2adb320"%0A        name    = "@"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 5 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  ~ server_ip = "188.245.227.94" -> (known after apply)%0A  ~ status    = "running" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Acquiring state lock. This may take a few moments...%0Adata.cloudinit_config.this: Reading...%0Ahcloud_network.this: Refreshing state... [id=10373733]%0Adata.hcloud_image.this: Reading...%0Ahcloud_ssh_key.default: Refreshing state... [id=24905759]%0Adata.hetznerdns_zone.this: Reading...%0Ahcloud_firewall.basic: Refreshing state... [id=1748182]%0Adata.cloudinit_config.this: Read complete after 0s [id=4166460097]%0Adata.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]%0Adata.hcloud_image.this: Read complete after 1s%0Ahcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]%0Ahcloud_server.projects-server: Refreshing state... [id=57836166]%0Ahetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]%0Ahcloud_volume.this: Refreshing state... [id=101632658]%0Ahcloud_server_network.this: Refreshing state... [id=57836166-10373733]%0Ahetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]%0Ahetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]%0Ahetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # hcloud_server.projects-server must be replaced%0A-/+ resource "hcloud_server" "projects-server" {%0A      + backup_window              = (known after apply)%0A      ~ datacenter                 = "fsn1-dc14" -> (known after apply)%0A      ~ id                         = "57836166" -> (known after apply)%0A      ~ ipv4_address               = "188.245.227.94" -> (known after apply)%0A      ~ ipv6_address               = "2a01:4f8:c012:20a7::1" -> (known after apply)%0A      ~ ipv6_network               = "2a01:4f8:c012:20a7::/64" -> (known after apply)%0A      - labels                     = {} -> null%0A        name                       = "projects-server"%0A      - placement_group_id         = 0 -> null%0A      ~ primary_disk_size          = 40 -> (known after apply)%0A      ~ status                     = "running" -> (known after apply)%0A      ~ user_data                  = "3wqxExxvS4NpFK5goy4DcSkhplA=" -> "6TJnYiNGkYx5i68+lsjISvxC0Ts=" # forces replacement%0A        # (12 unchanged attributes hidden)%0A    }%0A%0A  # hcloud_server_network.this must be replaced%0A-/+ resource "hcloud_server_network" "this" {%0A      - alias_ips   = [] -> null%0A      ~ id          = "57836166-10373733" -> (known after apply)%0A      ~ mac_address = "86:00:00:e3:63:49" -> (known after apply)%0A      ~ server_id   = 57836166 -> (known after apply) # forces replacement%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # hcloud_volume.this will be updated in-place%0A  ~ resource "hcloud_volume" "this" {%0A        id                = "101632658"%0A        name              = "persistent-storage"%0A      ~ server_id         = 57836166 -> (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks" {%0A        id      = "da4433c705ee878f5f69348f54b956ef"%0A        name    = "bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.bookmarks-api will be updated in-place%0A  ~ resource "hetznerdns_record" "bookmarks-api" {%0A        id      = "81253d86efc1c38e4afb06c662d6a409"%0A        name    = "api.bookmarks"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.geometrierechner will be updated in-place%0A  ~ resource "hetznerdns_record" "geometrierechner" {%0A        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"%0A        name    = "geometrierechner"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # hetznerdns_record.homepage will be updated in-place%0A  ~ resource "hetznerdns_record" "homepage" {%0A        id      = "912db7ec956005d7343406b8b2adb320"%0A        name    = "@"%0A      ~ value   = "188.245.227.94" -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 5 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  ~ server_ip = "188.245.227.94" -> (known after apply)%0A  ~ status    = "running" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```

</details>
<!-- thollander/actions-comment-pull-request "execution" -->